{"reviewerID": "A1VXOAVRGKGEAK", "asin": "0439893577", "reviewerName": "Angie", "helpful": [0, 0], "reviewText": "I like the item pricing. My granddaughter wanted to mark on it but I wanted it just for the letters.", "overall": 5.0, "summary": "Magnetic board", "unixReviewTime": 1390953600, "reviewTime": "01 29, 2014"}
{"reviewerID": "A8R62G708TSCM", "asin": "0439893577", "reviewerName": "Candace", "helpful": [1, 1], "reviewText": "Love the magnet easel... great for moving to different areas... Wish it had some sort of non skid pad on bottom though...", "overall": 4.0, "summary": "it works pretty good for moving to different areas", "unixReviewTime": 1395964800, "reviewTime": "03 28, 2014"}
{"reviewerID": "A21KH420DK0ICA", "asin": "0439893577", "reviewerName": "capemaychristy", "helpful": [1, 1], "reviewText": "Both sides are magnetic.  A real plus when you're entertaining more than one child.  The four-year old can find the letters for the words, while the two-year old can find the pictures the words spell.  (I bought letters and magnetic pictures to go with this board).  Both grandkids liked it a lot, which means I like it a lot as well.  Have not even introduced markers, as this will be used strictly as a magnetic board.", "overall": 5.0, "summary": "love this!", "unixReviewTime": 1359331200, "reviewTime": "01 28, 2013"}
{"reviewerID": "AR29QK6HPFYZ4", "asin": "0439893577", "reviewerName": "dcrm", "helpful": [0, 0], "reviewText": "Bought one a few years ago for my daughter and she loves it, still using it today. For the holidays we bought one for our niece and she loved it too.", "overall": 5.0, "summary": "Daughters love it", "unixReviewTime": 1391817600, "reviewTime": "02 8, 2014"}
{"reviewerID": "ACCH8EOML6FN5", "asin": "0439893577", "reviewerName": "DoyZ", "helpful": [1, 1], "reviewText": "I have a stainless steel refrigerator therefore there are not much space for my son to play with his magnet. Brought this for him to put his magnet on. He enjoys sticking his magnet on it. Great to have so he can play with his alphabet magnets.", "overall": 4.0, "summary": "Great to have so he can play with his alphabet ...", "unixReviewTime": 1399248000, "reviewTime": "05 5, 2014"}
{"reviewerID": "A1EDPGHC9EYBUN", "asin": "0439893577", "reviewerName": "kp", "helpful": [0, 0], "reviewText": "this is a nice magnetic board for the kids to carry around and play with the letter bought additional magnetic pieces from mellissa and doug to increase thier play time with them hope it works", "overall": 3.0, "summary": "grandma", "unixReviewTime": 1368662400, "reviewTime": "05 16, 2013"}
{"reviewerID": "A181ZNB42LISRZ", "asin": "0439893577", "reviewerName": "laura", "helpful": [0, 0], "reviewText": "This is just as I expected. It's not too sturdy but it stands up well. I'm not sure how long it will last, but my grandsons love plalying with it.", "overall": 3.0, "summary": "Serves the purpose", "unixReviewTime": 1356480000, "reviewTime": "12 26, 2012"}
{"reviewerID": "A1RBEJ5UQ1RWAW", "asin": "0439893577", "reviewerName": "Linda", "helpful": [1, 1], "reviewText": "My granddaughter really really likes this. I love that you can just fold it up and put it away. Would definately recommend.", "overall": 5.0, "summary": "Great", "unixReviewTime": 1397520000, "reviewTime": "04 15, 2014"}
{"reviewerID": "AFGGC7SIV964O", "asin": "0439893577", "reviewerName": "Maan's Mom", "helpful": [0, 0], "reviewText": "This is good product to have with unlimited possibilities. I also ordered the magnetic letters & numbers by Melissa & Doug.  The dry erase has to be erased quickly or they tend to leave marks. Also, the magnet is not very strong. It's a nice size & works very well for our needs.", "overall": 4.0, "summary": "A must have for any homeschooling classroom !", "unixReviewTime": 1364428800, "reviewTime": "03 28, 2013"}
{"reviewerID": "A2XU46XXNV19C8", "asin": "0439893577", "reviewerName": "Margaret", "helpful": [59, 59], "reviewText": "I keep this board on top of the hallway table so that I can quickly write notes (which won't get lost until I erase them) and it folds down neatly so it's easy to hide when company calls.  I also like the size -- not too big and not too small.  Quality magnets hold pretty good but I use it mainly for notes. NOTE:  Children's alphabet letters don't hold very well - they tend to slide.", "overall": 3.0, "summary": "Nifty little thing", "unixReviewTime": 1258588800, "reviewTime": "11 19, 2009"}
{"reviewerID": "A1TNIN1HQIW2L6", "asin": "0439893577", "reviewerName": "Mommy \"new mommy\"", "helpful": [0, 0], "reviewText": "Very nice to use with magnet letters and practice spelling. Holds the letters great and folds together nicely for storage. You can use it on a table or even the floor.", "overall": 5.0, "summary": "Works great!", "unixReviewTime": 1391990400, "reviewTime": "02 10, 2014"}
{"reviewerID": "A5I03TZD4J96V", "asin": "0439893577", "reviewerName": "N. Nick \"redgarnet54\"", "helpful": [2, 2], "reviewText": "Bought this board along with Melissa and Doug wood and magnetic letters and numbers kit.  The size is great for my 2-year-old grandson to play with, and there are 2 sides to use.  This is a big hit in my home and will grow with children as they become more creative...great learning tool too.  I also bought a container of magnetic foam objects so we can work with his spelling as he has now mastered his letters and numbers.  I believe it is also compatible with dry-erase markers for older children.  I highly recommend this board...great size to travel with also.", "overall": 5.0, "summary": "Perfect magnetic board!!!", "unixReviewTime": 1338422400, "reviewTime": "05 31, 2012"}
{"reviewerID": "A2N4973VTYMV52", "asin": "0439893577", "reviewerName": "Patz \"Patricia Dollar\"", "helpful": [0, 2], "reviewText": "The board had to be put away for my 18 month old grand daughter and we used just the refrigerator for the alphabet intending to bring back the board when she got a little older. The wooden letters are not painted, but rather covered with a colored paper which becomes loose rather easily. Most of the letters lasted for about 2 months before I had to throw them all out. Fortunately she knows all her alphabet by name and we are using other means to teach her how to put them together into words. At age 2 she can now spell her name - Molly.", "overall": 3.0, "summary": "Not Very Durable", "unixReviewTime": 1356480000, "reviewTime": "12 26, 2012"}
{"reviewerID": "A11Q7PYQ87R5Y2", "asin": "0439893577", "reviewerName": "PDJ", "helpful": [0, 0], "reviewText": "sturdy and perfect for coffee table. magnets stick easily and it's great for 2 sided products. plus, you can use dry erase on the board for when they get a bit older. good product", "overall": 5.0, "summary": "great magnet board", "unixReviewTime": 1400889600, "reviewTime": "05 24, 2014"}
{"reviewerID": "A3AJWITG95EY0Q", "asin": "0439893577", "reviewerName": "rely on feedback for purchases", "helpful": [17, 19], "reviewText": "We had purchased Melissa & Doug magnets & had some made & went looking for a board.  THIS IS IT!  It is so reasonable and has been in use ever since we received it.  You can spell words, put the Leap Frog base on it to put in letters/animals, numbers, etc.  It is also double sided.  Even though it's not intended they also like to put things under/inside the board.  They can roll things through it.  Highly recommend & every child should have one to put their magnets on.", "overall": 5.0, "summary": "Every child should have this!", "unixReviewTime": 1308873600, "reviewTime": "06 24, 2011"}
{"reviewerID": "A137TYEMD68CAQ", "asin": "0439893577", "reviewerName": "sassi214", "helpful": [3, 3], "reviewText": "We purchased this to go with the magnetic letters and animals sets we just got. I really love this easel. It's sturdy and large. We've used it many times without any issue whatsoever. I also love that it also functions as a wipeboard. A+", "overall": 5.0, "summary": "Quality product", "unixReviewTime": 1261872000, "reviewTime": "12 27, 2009"}
{"reviewerID": "A1TLCX2PM0TN8P", "asin": "0439893577", "reviewerName": "shopperju", "helpful": [0, 0], "reviewText": "This easel is the perfect size for my three year old grandson--he can use it on the floor or the tabletop, and loves to play with his letters and numbers.", "overall": 5.0, "summary": "great size", "unixReviewTime": 1393977600, "reviewTime": "03 5, 2014"}
{"reviewerID": "AQN75W8HMUFSP", "asin": "048645195X", "reviewerName": "Angie Dee \"Angie\"", "helpful": [0, 0], "reviewText": "This is my absolute favorite design book. The patterns are so intricate and fun to color. I can only imagine the possibilities!", "overall": 5.0, "summary": "Intricate", "unixReviewTime": 1354665600, "reviewTime": "12 5, 2012"}
{"reviewerID": "A32WT1ZEE4QGZB", "asin": "048645195X", "reviewerName": "Bella-Bella (By the sea ~~~)", "helpful": [2, 2], "reviewText": "Working with Mandala type coloring books can teach us a lot. 1) the light/dark placement of colors to bring into focus the center of the mandala (an example is on the cover of the book). 2) learning color choices that work together, teaching us the basics of the standard color wheel. 3) to stay concentrated to a task is good for improving or retaining cognitive capacities. 4) becomes a relaxing process, 5) last and certainly not least, to have some good fun. All of these points will improve our sense of well being.I like this particular Mandala coloring book by Marty Noble because it is a bit more complicated that her other mandala coloring books.  These are very traditional type designs that exhibit ancient sacred designs that span across several spiritual traditions.  They are easily removed from the book to work one at a time.  Four Star:  The designs are on each page, front and back.  This means you cannot use alcohol markers or markers that will bleed through the paper and ruin the other side.  Use high quality coloring pencils for best results.Creative Suggestion: Is to put your favorite design on an overhead projector, shine it on a chosen spot on a blank canvas and trace it. Then fill in with acrylics or oils or even water colors. Or you could complete this same process and project on a wall. This is sure to make an inspirational, yet soothing statement to your surroundings.", "overall": 4.0, "summary": "Creative, soothing and inspirational spiritual mandalas to enjoy", "unixReviewTime": 1388620800, "reviewTime": "01 2, 2014"}
{"reviewerID": "A1X3ESYZ79H59E", "asin": "048645195X", "reviewerName": "chaos", "helpful": [7, 8], "reviewText": "This book contains 30 full page designs that are beautiful and intricate in nature. Most of the designs are 7 x 9 1/2 inches. Great resource for any artist!", "overall": 5.0, "summary": "Beautiful designs", "unixReviewTime": 1241481600, "reviewTime": "05 5, 2009"}
{"reviewerID": "AKMEY1BSHSDG7", "asin": "048645195X", "reviewerName": "J. Arena", "helpful": [11, 13], "reviewText": "Prepare to be swept away by the beauty of the images that your color choices will create. The spaces to color are sometimes very small, and require careful work and a steady hand. However, the payoff is immense. These images are beautifully done, and the work you do on them will inspire you.You may want to photocopy the pages if you wish to display or use each one, since they are printed back-to-back.Just beautifully done!", "overall": 5.0, "summary": "Takes a delicate touch!", "unixReviewTime": 1212105600, "reviewTime": "05 30, 2008"}
{"reviewerID": "A2GYEPZKMD3J2Z", "asin": "048645195X", "reviewerName": "J.L. Farnsworth", "helpful": [0, 0], "reviewText": "Oh, and for my teenager too.  Because that's who I really ordered it for.  Honest.  But, I am going to borrow it.  I call it sharing.I ordered several of these - different designs - but all by Dover and Marty Noble.  Of all of them, this is my favorite DESIGN  - but least favorite layout.  It doesn't take up the entire page like the rest of the books do. The design is in the center, and there is quite a bit of white, blank page, left all around it on every side.  What you see on the cover, is probably the biggest design in all of the book.  I will try to get a picture of the inside in the next few days, and post it here for you to see.Despite that, I do love the design.  (Just wish it were bigger, taking up more of the page.)  I love coloring.  It doesn't matter to me what it is, I just like to color.  I love that I have small children still (9 and 2) that I can color with, without looking completely silly (Not that I'd really care).  Coloring is relaxing.I stumbled across this book when I was looking for art supplies, and coloring books for my 17-year-old. (I typed in 'coloring book for teens' on a whim).  And I was happy to find these designs by Marty Noble.  The price was reasonable, and the quality is nice.  It's not a thick (lots of pages) coloring book like you would find for small children, only around 40 pages, I think.  But the pages aren't thin like a child's coloring book either.  They are a little thicker.  A little better quality.  Nice bold white sheets.  I'm thinking you may be able to use markers on this without them bleeding through, but I don't know for sure yet.  I'm going to try it.I'm pleased with my purchase, and will definitely be ordering more.", "overall": 5.0, "summary": "A coloring book for ME!  If only I'd known earlier!", "unixReviewTime": 1388102400, "reviewTime": "12 27, 2013"}
{"reviewerID": "A2IB3CUVPRE28M", "asin": "048645195X", "reviewerName": "Karen", "helpful": [1, 1], "reviewText": "Very nice for time destraction. Bought for my 14 year old niece. Although she would rather have a controller or keyboard in her hand, I at times I give her this for a &#34;technology break&#34;!", "overall": 5.0, "summary": "Inricate and time consuming. A great chance to get or give (if gift) a break from television!", "unixReviewTime": 1384905600, "reviewTime": "11 20, 2013"}
{"reviewerID": "A1MPWLA14I9OWW", "asin": "048645195X", "reviewerName": "MamaHen", "helpful": [0, 1], "reviewText": "I can color right along with my grandchildren, without feeling intellectually compromised at the project.  This book is so amazing that I have used some of the designs for stained glass windows.  I highly recommend this for anyone who does not want to grow out of a favorite pasttime.", "overall": 5.0, "summary": "Now I don't have to grow up", "unixReviewTime": 1364256000, "reviewTime": "03 26, 2013"}
{"reviewerID": "ASVLLLS52G0A8", "asin": "048645195X", "reviewerName": "MICHELLE", "helpful": [0, 0], "reviewText": "This coloring book has provided hours of creativity and entertainment. I color in this book while watching tv to give my hand something to do.", "overall": 5.0, "summary": "Love this coloring book", "unixReviewTime": 1388448000, "reviewTime": "12 31, 2013"}
{"reviewerID": "AU21B5JSG23FQ", "asin": "048645195X", "reviewerName": "mom2greatkids", "helpful": [1, 1], "reviewText": "The pictures in this book are very detailed and frustrating to do.  Not what I was expecting. I have many Dover books and this was a let down.", "overall": 3.0, "summary": "Good book, just not a favorite", "unixReviewTime": 1375488000, "reviewTime": "08 3, 2013"}
{"reviewerID": "AKU1TXYBJKSV6", "asin": "048645195X", "reviewerName": "Tabitha Few \"Tabitha\"", "helpful": [5, 6], "reviewText": "I just recieved my copy of decorative tile designs, and I was thrilled with the actual contents. However, this product could have been a bit better if they had been printed on one sided paper. (or even paper that was a bit thicker) It is impossible to use paints or markers on these pages, and crayons would be entirely too wide to use effectively due to the very small spaces on a good deal of the designs.. I don't mind using colored pencils, so I'm not completely disappointed, but the ability to use markers without serious bleed-through would have made this product worth five stars. All in all, this is definitely best for an older child or adult, especially if they love coloring with pencils and/or like intricate patterns.", "overall": 3.0, "summary": "Beautiful designs, but not good for markers", "unixReviewTime": 1264636800, "reviewTime": "01 28, 2010"}
{"reviewerID": "A252DMIM13A3K7", "asin": "048645195X", "reviewerName": "Tamka", "helpful": [0, 0], "reviewText": "The art is nice in this coloring book. But I find some of the pages to be boring and repetitive. Thin pages mean you cannot use markers, which is a bummer.", "overall": 4.0, "summary": "Not bad", "unixReviewTime": 1383004800, "reviewTime": "10 29, 2013"}
{"reviewerID": "A1UQ9JZLKLAO7X", "asin": "0545496470", "reviewerName": "A. Perez \"ladybug\"", "helpful": [0, 6], "reviewText": "This book looks really fun and cool. Haven't opened or used it yet because I got it for my 6 year old daughter for xmas but i know she will enjoy doing the projects with me.  she is very creative and loves crazy weird stuff so this seems right up her alley.", "overall": 4.0, "summary": "Book of impossible objects", "unixReviewTime": 1386633600, "reviewTime": "12 10, 2013"}
{"reviewerID": "ADGYS9FJ3G8SG", "asin": "0545496470", "reviewerName": "Happily crazy mom", "helpful": [5, 20], "reviewText": "Bought this book for my optical illusion obsessed son (10) to read while on a loooooong driving trip. It wasn't the best choice because there are lots of extra pieces and loose materials in the back of the book for performing these illusions. We haven't brought it back out since getting home but I'm sure it will be great!", "overall": 3.0, "summary": "lots of stuff", "unixReviewTime": 1380067200, "reviewTime": "09 25, 2013"}
